#### Description
International Breweries Plc manufactures beer and non-alcoholic malt drinks. Its activities include the brewing, packaging, and marketing of beer, alcoholic flavoured and non-flavoured alcoholic beverages, and soft drinks. The company was founded by Lawrence Omole on December 22, 1971 and is headquartered in Lagos, Nigeria.

In [1]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:28_March@localhost/international_breweries')
%reload_ext sql
%sql $engine.url

##### Drop Columns if the exist already

In [63]:
%%sql 
ALTER TABLE breweries_sales 
DROP COLUMN total_cost,
DROP COLUMN total_sale,
DROP COLUMN profit,
DROP COLUMN roi,
DROP COLUMN shortMnthName;

 * postgresql://postgres:***@localhost/international_breweries
Done.

[]

##### Creating new columns

In [64]:
%%sql
ALTER TABLE breweries_sales
ADD COLUMN total_cost bigint,
ADD COLUMN total_sale bigint,
ADD COLUMN profit bigint,
ADD COLUMN roi NUMERIC(10, 5),
ADD COLUMN shortMnthName character(3);

 * postgresql://postgres:***@localhost/international_breweries
Done.

[]

##### Populating new columns with values

In [67]:
%%sql
UPDATE breweries_sales 
SET total_cost = unit_cost * CAST(quantity_sold AS INTEGER),
    total_sale = unit_price * CAST(quantity_sold AS INTEGER),
    profit = (unit_price * CAST(quantity_sold AS INTEGER)) - (unit_cost * CAST(quantity_sold AS INTEGER)),
    roi = ((unit_price * CAST(quantity_sold AS INTEGER)) - (unit_cost * CAST(quantity_sold AS INTEGER)))/(unit_cost * CAST(quantity_sold AS INTEGER))::NUMERIC,
    shortMnthName = LEFT(month, 3);

 * postgresql://postgres:***@localhost/international_breweries
1047 rows affected.

[]

In [68]:
%%sql
 
-- Preview

SELECT *
FROM breweries_sales
LIMIT 3

 * postgresql://postgres:***@localhost/international_breweries
3 rows affected.

[('10932', 'northwest', 'April', 2020, 'Jones', 'beta malt', 80, 150, 802, 'Nigeria', 64160, 120300, 56140, Decimal('0.87500'), 'Apr'),
 ('10936', 'west', 'August', 2020, 'Gill', 'castle lite', 180, 450, 923, 'Ghana', 166140, 415350, 249210, Decimal('1.50000'), 'Aug'),
 ('10940', 'northcentral ', 'December', 2020, 'Jardine', 'grand malt', 90, 150, 936, 'Senegal', 84240, 140400, 56160, Decimal('0.66667'), 'Dec')]

In [52]:
%%sql
SELECT DISTINCT(country) unique_countries
FROM breweries_sales

 * postgresql://postgres:***@localhost/international_breweries
5 rows affected.

[('Nigeria',), ('Benin',), ('Senegal',), ('Ghana',), ('Togo',)]

In [53]:
%%sql
SELECT DISTINCT(region) unique_regions
FROM breweries_sales

 * postgresql://postgres:***@localhost/international_breweries
6 rows affected.

[('southsouth',),
 ('west',),
 ('northcentral ',),
 ('northeast ',),
 ('Southeast',),
 ('northwest',)]

In [54]:
%%sql
SELECT DISTINCT(sales_rep) unique_countries
FROM breweries_sales

 * postgresql://postgres:***@localhost/international_breweries
11 rows affected.

[('Morgan',),
 ('Gill',),
 ('Jones',),
 ('Sorvino',),
 ('Kivell',),
 ('Thompson',),
 ('Jardine',),
 ('Andrews',),
 ('Smith',),
 ('Howard',),
 ('Parent',)]

In [55]:
%%sql
SELECT DISTINCT(brand) unique_countries
FROM breweries_sales

 * postgresql://postgres:***@localhost/international_breweries
7 rows affected.

[('beta malt',),
 ('eagle lager',),
 ('grand malt',),
 ('hero',),
 ('budweiser',),
 ('castle lite',),
 ('trophy',)]

In [75]:
import pandas as pd
import plotly.express as px
import plotly.offline as po

In [77]:
query = '''
SELECT country, AVG(quantity_sold) avg_qty
FROM breweries_sales
GROUP BY country
ORDER BY avg_qty DESC
'''
cntry_avg_qty = pd.read_sql_query(query, engine)
cntry_avg_qty

   country     avg_qty
0  Senegal  865.684211
1  Nigeria  853.842857
2    Ghana  848.833333
3    Benin  843.655502
4     Togo  841.665072

In [69]:
%%sql
CREATE TEMPORARY TABLE nigeria AS
    SELECT  *
    FROM    breweries_sales
    WHERE   Country = 'Nigeria';

SELECT  * 
FROM    Nigeria
LIMIT   5

 * postgresql://postgres:***@localhost/international_breweries
(psycopg2.errors.DuplicateTable) relation "nigeria" already exists

[SQL: CREATE TEMPORARY TABLE Nigeria AS
    SELECT  *
    FROM    breweries_sales
    WHERE   Country = 'Nigeria';]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [70]:
%%sql
SELECT * FROM nigeria LIMIT 5

 * postgresql://postgres:***@localhost/international_breweries
5 rows affected.

[('10932', 'northwest', 'April', 2020, 'Jones', 'beta malt', 80, 150, 802, 'Nigeria', 64160, 120300, 56140, Decimal('0.87500')),
 ('10977', 'Southeast', 'January', 2020, 'Gill', 'budweiser', 250, 500, 919, 'Nigeria', 229750, 459500, 229750, Decimal('1.00000')),
 ('11007', 'Southeast', 'July', 2020, 'Howard', 'eagle lager', 170, 250, 984, 'Nigeria', 167280, 246000, 78720, Decimal('0.47059')),
 ('11022', 'northwest', 'October', 2020, 'Jardine', 'hero', 150, 200, 851, 'Nigeria', 127650, 170200, 42550, Decimal('0.33333')),
 ('11027', 'southsouth', 'March', 2020, 'Kivell', 'castle lite', 180, 450, 847, 'Nigeria', 152460, 381150, 228690, Decimal('1.50000'))]

In [71]:
%%sql
SELECT DISTINCT(sales_rep) FROM nigeria

 * postgresql://postgres:***@localhost/international_breweries
11 rows affected.

[('Thompson',),
 ('Jones',),
 ('Kivell',),
 ('Jardine',),
 ('Howard',),
 ('Smith',),
 ('Sorvino',),
 ('Andrews',),
 ('Gill',),
 ('Parent',),
 ('Morgan',)]

In [2]:
import pandas as pd
brew = pd.read_csv('International_Breweries.csv')
brew

,Sales_ID,Region,Months,Year,Sales_Rep,Brands,Unit_Cost,Unit_Price,Quantity,Country
0,10101,Southeast,January,2020,Jardine,trophy,150,200,725,Ghana
1,10106,northcentral,June,2020,Jardine,beta malt,80,150,798,Ghana
2,10109,southsouth,September,2020,Morgan,budweiser,250,500,700,Benin
3,10112,northcentral,December,2020,Jones,hero,150,200,902,Nigeria
4,10116,northwest,April,2020,Jones,budweiser,250,500,709,Ghana
...,...,...,...,...,...,...,...,...,...,...
1042,11139,Southeast,July,2018,Gill,castle lite,180,450,907,Benin
1043,11140,west,August,2018,Sorvino,eagle lager,170,250,949,Senegal
1044,11143,northeast,November,2018,Jardine,grand malt,90,150,962,Togo
1045,11144,northcentral,December,2018,Jardine,trophy,150,200,892,Benin
1046,11146,west,February,2018,Jones,castle lite,180,450,939,Ghana

In [9]:
brew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1047 entries, 0 to 1046
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sales_ID    1047 non-null   int64
 1   Region      1047 non-null   object
 2   Months      1047 non-null   object
 3   Year        1047 non-null   int64
 4   Sales_Rep   1047 non-null   object
 5   Brands      1047 non-null   object
 6   Unit_Cost   1047 non-null   int64
 7   Unit_Price  1047 non-null   int64
 8   Quantity    1047 non-null   int64
 9   Country     1047 non-null   object
dtypes: int64(5), object(5)
memory usage: 81.9+ KB

In [4]:
brew[brew['Country'] == 'Ghana']['Region'].unique()

array(['Southeast', 'northcentral ', 'northwest', 'northeast ',
       'southsouth', 'west'], dtype=object)

In [8]:
brew[brew['Country'] == 'Benin']['Sales_Rep'].unique()

array(['Morgan', 'Smith', 'Jardine', 'Jones', 'Parent', 'Gill', 'Andrews',
       'Sorvino', 'Kivell', 'Thompson', 'Howard'], dtype=object)